expense_tracker/jmeter/expense_crud_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
<hashTree>
  <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Expense CRUD Test" enabled="true">
    <boolProp name="TestPlan.functional_mode">false</boolProp>
    <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
    <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
      <collectionProp name="Arguments.arguments">
        <elementProp name="base_url" elementType="Argument">
          <stringProp name="Argument.name">base_url</stringProp>
          <stringProp name="Argument.value">http://172.31.94.133:30080</stringProp>
          <stringProp name="Argument.metadata">=</stringProp>
        </elementProp>
      </collectionProp>
    </elementProp>
  </TestPlan>
  <hashTree>

    <!-- Thread Group -->
    <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="User Load 1" enabled="true">
      <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
        <boolProp name="LoopController.continue_forever">false</boolProp>
        <stringProp name="LoopController.loops">1</stringProp>
      </elementProp>
      <stringProp name="ThreadGroup.num_threads">${__P(threads,1)}</stringProp>
      <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      <boolProp name="ThreadGroup.scheduler">false</boolProp>
      <stringProp name="ThreadGroup.duration">${__P(duration,5)}</stringProp>
    </ThreadGroup>
    <hashTree>

      <!-- HTTP Cookie Manager -->
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">false</boolProp>
      </CookieManager>
      <hashTree/>

      <!-- 1️⃣ GET Login Page -->
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Login Page" enabled="true">
        <stringProp name="HTTPSampler.domain">172.31.94.133</stringProp>
        <stringProp name="HTTPSampler.port">30080</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.path">/login/</stringProp>
        <stringProp name="HTTPSampler.method">GET</stringProp>
      </HTTPSamplerProxy>
      <hashTree>
        <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Login CSRF Token" enabled="true">
          <stringProp name="RegexExtractor.refname">login_csrf</stringProp>
          <stringProp name="RegexExtractor.regex">name=['"]csrfmiddlewaretoken['"] value=['"](.+?)['"]</stringProp>
          <stringProp name="RegexExtractor.template">$1$</stringProp>
          <stringProp name="RegexExtractor.default">NOT_FOUND</stringProp>
        </RegexExtractor>
      </hashTree>

      <!-- 2️⃣ POST Login -->
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Login" enabled="true">
        <stringProp name="HTTPSampler.domain">172.31.94.133</stringProp>
        <stringProp name="HTTPSampler.port">30080</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.path">/login/</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments">
            <elementProp name="csrfmiddlewaretoken" elementType="HTTPArgument">
              <stringProp name="Argument.name">csrfmiddlewaretoken</stringProp>
              <stringProp name="Argument.value">${login_csrf}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="username" elementType="HTTPArgument">
              <stringProp name="Argument.name">username</stringProp>
              <stringProp name="Argument.value">testuser</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="password" elementType="HTTPArgument">
              <stringProp name="Argument.name">password</stringProp>
              <stringProp name="Argument.value">password123</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </elementProp>
      </HTTPSamplerProxy>
      <hashTree/>

      <!-- 3️⃣ GET Add Expense Page -->
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Add Expense Page" enabled="true">
        <stringProp name="HTTPSampler.domain">172.31.94.133</stringProp>
        <stringProp name="HTTPSampler.port">30080</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.path">/add/</stringProp>
        <stringProp name="HTTPSampler.method">GET</stringProp>
      </HTTPSamplerProxy>
      <hashTree>
        <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Add Expense CSRF Token" enabled="true">
          <stringProp name="RegexExtractor.refname">csrf_token_add</stringProp>
          <stringProp name="RegexExtractor.regex">name="csrfmiddlewaretoken" value="(.+?)"</stringProp>
          <stringProp name="RegexExtractor.template">$1$</stringProp>
          <stringProp name="RegexExtractor.default">NOT_FOUND</stringProp>
        </RegexExtractor>
      </hashTree>

      <!-- 4️⃣ POST Add Expense -->
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Add Expense" enabled="true">
        <stringProp name="HTTPSampler.domain">172.31.94.133</stringProp>
        <stringProp name="HTTPSampler.port">30080</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.path">/add/</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments">
            <elementProp name="csrfmiddlewaretoken" elementType="HTTPArgument">
              <stringProp name="Argument.name">csrfmiddlewaretoken</stringProp>
              <stringProp name="Argument.value">${csrf_token_add}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="name" elementType="HTTPArgument">
              <stringProp name="Argument.name">name</stringProp>
              <stringProp name="Argument.value">Test</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="amount" elementType="HTTPArgument">
              <stringProp name="Argument.name">amount</stringProp>
              <stringProp name="Argument.value">1</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="category" elementType="HTTPArgument">
              <stringProp name="Argument.name">category</stringProp>
              <stringProp name="Argument.value">FOOD</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="description" elementType="HTTPArgument">
              <stringProp name="Argument.name">description</stringProp>
              <stringProp name="Argument.value">Auto expense entry</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </elementProp>
      </HTTPSamplerProxy>
      <hashTree/>

    </hashTree>
  </hashTree>
</hashTree>
</jmeterTestPlan>